;; -*- no-byte-compile: t; -*-
;;; .doom.d/packages.el

;;; Examples:
;; (package! some-package)
;; (package! another-package :recipe (:host github :repo "username/repo"))
;; (package! builtin-package :disable t)
(package! all-the-icons)
(package! avy)
(package! company-lsp)
(package! doom-themes)
(package! elpy)
(package! emmet-mode)
(package! flymake-jslint)
(package! go)
(package! go-autocomplete)
(package! go-eldoc)
(package! go-guru)
(package! go-imports)
(package! go-playground)
(package! go-snippets)
(package! hc-zenburn-theme)
(package! helm-css-scss)
(package! helm-emmet)
(package! helm-go-package)
(package! js-auto-format-mode)
(package! js2-mode)
(package! js2-refactor)
(package! minesweeper)
(package! moe-theme)
(package! org-super-agenda)
(package! pacmacs)
(package! powerline)
(package! py-autopep8)
(package! tern)
(package! tern-auto-complete)
(package! tide)
(package! treemacs-icons-dired)
(package! treemacs-magit)
(package! treemacs-projectile)
(package! wttrin :recipe (:host github :repo "bcbcarl/emacs-wttrin"))
(package! easy-hugo)

;; Disable Packages
(package! highlight-indentation :disable t)
